import os

import pandas as pd

from researcher_network_mk.utils import get_project_root
from researcher_network_mk.transliteration import transliterate_cyrillic_to_latin

# Function to transliterate names from Macedonian Cyrillic to Latin
def translate_names_to_latin(names_mk):
    return [transliterate_cyrillic_to_latin(name) for name in names_mk]

def main():
    results_path = os.path.join(get_project_root(), "data", "researchers", "ukim")
# List of names in Macedonian Cyrillic
    data_mk = [
        "Димитар Пандев", "Емилија Црвенковска", "Искра Пановска - Димкова", "Катерина Велјановска",
        "Лидија Аризанковска", "Славица Велева", "Анета Дучевска", "Симон Саздов", "Томислав Треневски",
        "Марјан Марковиќ", "Татјана Гочкова - Стојановска", "Станислава Тофоска - Јанеска", "Марија Паунова",
        "Гордана Алексова", "Бојан Петревски", "Бобан Карапејовски", "Нина Анастасова-Шкрињариќ", "Венко Андоновски",
        "Весна Мојсова-Чепишевска", "Ангелина Бановиќ-Марковска", "Јасна Котеска", "Кристина Николовска",
        "Трајче Стамески", "Искра Тасевска Хаџи-Бошкова", "Иван Антоновски", "Аслан Хамити", "Агим Лека",
        "Мирлинда Крифца-Беќири", "Мируше Хоџа", "Ваљбона Тоска", "Ајтен Ќамили", "Исмет Османи", "Теута Арифи",
        "Фаркета Дибра Зеќири", "Лулјета Адили Челику", "Октај Ахмед", "Назим Ибрахим", "Осман Емин", "Фатима Хоџин",
        "Милица Анчевски", "Лидија Танушевска", "Јасминка Делова-Силјанова", "Биљана Мирчевска-Бошева",
        "Екатерина Терзијоска", "Ирен Алчевска", "Маргарита Велевска", "Мира Трајкова", "Ирина Бабамова",
        "Мирјана Алексоска-Чкатроска", "Елисавета Поповска", "Снежана Петрова", "Јоана Хаџи-Лега Христоска",
        "Сања Михајловиќ-Костадиновска", "Анита Кузманоска", "Раду-Михаил Атанасов", "Севда Лазаревска",
        "Наташа Алексоска", "Милена Касапоска-Чадловска", "Милена Недевска", "Игор Поповски", "Емилија Бојковска",
        "Зорица Николовска", "Силвана Симоска", "Емина Авдиќ", "Бисера Станкова", "Маријана Ѓорѓиева", "Жанета Савиќ",
        "Сашка Грујовска-Миланова", "Томас Маир", "Јованка Лазаревска–Станчевска", "Калина Малеска",
        "Анжела Николовска", "Соња Витанова-Стрезова", "Зорица Трајкова", "Румена Бужаровска",
        "Билјана Наумоска-Саракинска", "Елена Ончевска Агер", "Анастазија Киркова-Наскова", "Наташа Стојановска-Илиевска",
        "Мери Лазаревска", "Мира Беќар", "Милан Дамјаноски", "Анета Наумоска", "Ивана Дуцкиноска", "Маја Јошевска-Петрушевска",
        "Елизабета Шелева", "Лидија Дракулевска", "Маја Бојаџиевска", "Славица Србиновска", "Владимир Мартиновски",
        "Марија Ѓорѓиева-Димова", "Кристина Николовска", "Ведран Диздаревиќ", "Солзица Поповска", "Татјана Панова-Игњатовиќ",
        "Катарина Ѓурчевска-Атанасовска", "Милена Саздовска-Пигуловска", "Соња Китановска-Кимовска", "Владимир Цветкоски",
        "Николче Мицкоски", "Магдалена Симионска", "Бесим Алили", "Александра Саржоска", "Анастасија Ѓурчинова",
        "Лучиана Гуидо-Шремпф", "Руска Ивановска-Наскова", "Ирина Талевска", "Валентина Милошевиќ-Симоновска",
        "Бранка Гривчевска", "Соња Мизерендино"
    ]

# Transliterate the names
    data = translate_names_to_latin(data_mk)

    os.makedirs(results_path, exist_ok=True)
    pd.DataFrame(data, columns=["name"]).to_csv(os.path.join(results_path, "filoloski.csv"))


if __name__ == "__main__":
    main()
