import os

import pandas as pd

from researcher_network_mk.utils import get_project_root
from researcher_network_mk.transliteration import transliterate_cyrillic_to_latin

# Function to transliterate Macedonian Cyrillic names to Latin letters
def translate_names_to_latin(names_mk):
    return [transliterate_cyrillic_to_latin(name) for name in names_mk]

def main():
    results_path = os.path.join(get_project_root(), "data", "researchers", "ukim")
    data_mk = [
        "Елизабета Ангелова",
        "Елизабета Мискоска-Милевска",
        "Емељ Туна",
        "Звезда Богевска",
        "Звонко Пацаноски",
        "Златко Арсов",
        "Златко Пејковски",
        "Златко Прцуловски",
        "Зоран Димов",
        "Зоран Т. Поповски",
        "Ивана Јанеска Стаменковска",
        "Иле Цанев",
        "Катерина Беличовска",
        "Кочо Порчу",
        "Крум Бошков",
        "Ленче Велкоска-Марковска",
        "Маргарита Давитковска",
        "Марина Нацка",
        "Марина Стојанова",
        "Марија Вукелиќ-Шутоска",
        "Татјана Прентовиќ",
        "Ѓоко Буневски",
        "Јован Аждерски",
        "Љубица Каракашова",
        "Александар Узунов",
        "Александра Мартиновска-Стојческа",
        "Александра Силовска Николова",
        "Ана Котевска",
        "Ана Симоновска",
        "Билјана Кузмановска",
        "Билјана Ристаќовска Ширговска",
        "Бојан Поповски",
        "Владо Вуковиќ",
        "Вјекослав Танасковиќ",
        "Гордана Попсимонова",
        "Дане Бошев",
        "Драган Ѓошевски",
        "Драги Димитриевски",
        "Драгослав Коцевски",
        "Душица Санта",
        "Марјан Кипријановски",
        "Методија Трајчев",
        "Миле Маркоски",
        "Миле Пешевски",
        "Мирјана С. Јанкуловска",
        "Мирјана Јанкуловска",
        "Михаил Петков",
        "Надица Сандева Атанасова",
        "Никола Сарагиновски",
        "Олга Најденовска",
        "Ордан Чукалиев",
        "Петар Христов",
        "Раде Русевски",
        "Ристе Еленов",
        "Ромина Кабранова",
        "Рукие Агич",
        "Силвана Манасиевска",
        "Соња Ивановска",
        "Соња Србиновска",
        "Сребра Илиќ - Попова",
        "Сретен Андонов",
        "Среќко Ѓорѓиевски",
        "Станислава Лазаревска",
        "Татјана Миткова",
        "Тошо Арсов",
        "Фросина Бабановска Миленковска",
        "Хрисула Кипријановска"
    ]

# Transliterate the names
    data = translate_names_to_latin(data_mk)

    os.makedirs(results_path, exist_ok=True)
    pd.DataFrame(data, columns=["name"]).to_csv(os.path.join(results_path, "zemjodelski.csv"))

if __name__ == "__main__":
    main()
