from transliterate import translit

data_mk = [
    "Елизабета Ангелова",
    "Елизабета Мискоска-Милевска",
    "Емељ Туна",
    "Звезда Богевска",
    "Звонко Пацаноски",
    "Златко Арсов",
    "Златко Пејковски",
    "Златко Прцуловски",
    "Зоран Димов",
    "Зоран Т. Поповски",
    "Ивана Јанеска Стаменковска",
    "Иле Цанев",
    "Катерина Беличовска",
    "Кочо Порчу",
    "Крум Бошков",
    "Ленче Велкоска-Марковска",
    "Маргарита Давитковска",
    "Марина Нацка",
    "Марина Стојанова",
    "Марија Вукелиќ-Шутоска",
    "Татјана Прентовиќ",
    "Ѓоко Буневски",
    "Јован Аждерски",
    "Љубица Каракашова",
    "Александар Узунов",
    "Александра Мартиновска-Стојческа",
    "Александра Силовска Николова",
    "Ана Котевска",
    "Ана Симоновска",
    "Билјана Кузмановска",
    "Билјана Ристаќовска Ширговска",
    "Бојан Поповски",
    "Владо Вуковиќ",
    "Вјекослав Танасковиќ",
    "Гордана Попсимонова",
    "Дане Бошев",
    "Драган Ѓошевски",
    "Драги Димитриевски",
    "Драгослав Коцевски",
    "Душица Санта",
    "Марјан Кипријановски",
    "Методија Трајчев",
    "Миле Маркоски",
    "Миле Пешевски",
    "Мирјана С. Јанкуловска",
    "Мирјана Јанкуловска",
    "Михаил Петков",
    "Надица Сандева Атанасова",
    "Никола Сарагиновски",
    "Олга Најденовска",
    "Ордан Чукалиев",
    "Петар Христов",
    "Раде Русевски",
    "Ристе Еленов",
    "Ромина Кабранова",
    "Рукие Агич",
    "Силвана Манасиевска",
    "Соња Ивановска",
    "Соња Србиновска",
    "Сребра Илиќ - Попова",
    "Сретен Андонов",
    "Среќко Ѓорѓиевски",
    "Станислава Лазаревска",
    "Татјана Миткова",
    "Тошо Арсов",
    "Фросина Бабановска Миленковска",
    "Хрисула Кипријановска"
]

# Function to transliterate Macedonian Cyrillic names to Latin letters
def translate_names_to_latin(names_mk):
    return [translit(name, 'mk', reversed=True) for name in names_mk]

# Transliterate the names
data_latin = translate_names_to_latin(data_mk)

# Print the original and transliterated lists
print("Original names in Macedonian Cyrillic:")
print(data_mk)
print("\nTranslated names in Latin letters:")
print(data_latin)